Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПредварительнаяЗапись") Тогда
		
		ПроверитьДубликатРеализации(ДанныеЗаполнения);
		
		Контрагент        = ДанныеЗаполнения.Клиент;
		Сотрудник         = ДанныеЗаполнения.Сотрудник;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента    = ДанныеЗаполнения.СуммаДокумента;
		
		Комментарий = "Введен на основании: " + ДанныеЗаполнения;
		
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Сумма      = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.Услуга     = ТекСтрокаУслуги.Услуга;
			НоваяСтрока.Цена       = ТекСтрокаУслуги.Цена;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ЗаписьОбъект = ДокументОснование.ПолучитьОбъект();
		ЗаписьОбъект.УслугаОказана = Проведен;
		ЗаписьОбъект.ОбменДанными.Загрузка = Истина;
		ЗаписьОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Продажи.Записывать         = Истина;
	Движения.УчетЗатрат.Записывать      = Истина;
	Движения.ЗаказыКлиентов.Записывать  = Истина;
	Движения.Хозрасчетный.Записывать    = Истина;
	
	Движения.ТоварыНаСкладах.Записать();
	Движения.Продажи.Записать();
	Движения.УчетЗатрат.Записать();
	Движения.ЗаказыКлиентов.Записать();
	Движения.Хозрасчетный.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТовары.Ссылка.Склад КАК Склад,
	|	СУММА(РеализацияТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.Реализация.Товары КАК РеализацияТовары
	|ГДЕ
	|	РеализацияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТовары.Номенклатура,
	|	РеализацияТовары.Ссылка.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Услуга,
	|	NULL,
	|	СУММА(РеализацияУслуги.Количество),
	|	СУММА(РеализацияУслуги.Сумма)
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияУслуги.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоТовар,
	|	ВТ_Товары.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ВТ_Товары.Количество КАК КоличествоВДокументе,
	|	ВТ_Товары.Сумма КАК СуммаВДокументе,
	|	ВТ_Товары.Склад КАК Склад,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ВТ_Товары.Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_Товары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МоментВремени,
	|				(Номенклатура, Склад) В
	|					(ВЫБРАТЬ
	|						ВТ_Товары.Номенклатура,
	|						ВТ_Товары.Склад
	|					ИЗ
	|						ВТ_Товары КАК ВТ_Товары)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Товары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВТ_Товары.Склад = ТоварыНаСкладахОстатки.Склад";
	
	ВыборкаНоменклатура = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		СтоимостьОбщаяНоменклатуры    = 0;
		КоличествоОбщееНоменклатуры   = 0;
		СуммаПродажиОбщееНоменклатуры = 0;
		
		Если ВыборкаНоменклатура.ЭтоТовар Тогда
			
			КоличествоСписать = ВыборкаНоменклатура.КоличествоВДокументе;
			КоличествоОстаток = ВыборкаНоменклатура.КоличествоОстаток;
			СуммаОстаток      = ВыборкаНоменклатура.СуммаОстаток;
			
			Если КоличествоСписать > КоличествоОстаток Тогда
				Отказ = Истина;
				Нехватка = КоличествоСписать - КоличествоОстаток;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Превышение остатка по номенклатуре ""%1"" на складе ""%2"" в количестве ""%3""!", 
				ВыборкаНоменклатура.НоменклатураПредставление, ВыборкаНоменклатура.Склад, Нехватка);
				Сообщение.Поле = "Товары";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				
				Продолжить;
			КонецЕсли;
			
			Если НЕ Отказ Тогда
				Если КоличествоСписать = КоличествоОстаток Тогда
					СуммаСписания = СуммаОстаток;
				Иначе
					СуммаСписания = ОКР(КоличествоСписать / КоличествоОстаток * СуммаОстаток, 2);
				КонецЕсли;
				
				Движение = Движения.ТоварыНаСкладах.Добавить();
				Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
				Движение.Период       = Дата;
				Движение.Номенклатура = ВыборкаНоменклатура.Номенклатура;
				Движение.Склад        = ВыборкаНоменклатура.Склад;
				Движение.Количество   = КоличествоСписать;
				Движение.Сумма        = СуммаСписания;
				
				ДвижениеЗатрат = Движения.УчетЗатрат.Добавить();
				ДвижениеЗатрат.Период       = Дата;
				ДвижениеЗатрат.СтатьяЗатрат = ВыборкаНоменклатура.СтатьяЗатрат;
				ДвижениеЗатрат.Сумма        = СуммаСписания;
				
				ДвижениеХозрасчетный = Движения.Хозрасчетный.Добавить();
				ДвижениеХозрасчетный.СчетДт     = ПланыСчетов.Хозрасчетный.Продажи;
				ДвижениеХозрасчетный.СчетКт     = ВыборкаНоменклатура.СчетБухгалтерскогоУчета;
				ДвижениеХозрасчетный.Период     = Дата;
				ДвижениеХозрасчетный.Сумма      = СуммаСписания;
				ДвижениеХозрасчетный.Содержание = "Списана себестоимость товарно-материальных ценностей";
				
				БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчетный.СчетКт, 
				ДвижениеХозрасчетный.СубконтоКт, ВыборкаНоменклатура.Номенклатура);
				
				СтоимостьОбщаяНоменклатуры    = СуммаСписания;
				КоличествоОбщееНоменклатуры   = КоличествоСписать;
				СуммаПродажиОбщееНоменклатуры = ВыборкаНоменклатура.СуммаВДокументе;
			КонецЕсли;
			
		Иначе
			Если ЗначениеЗаполнено(ДокументОснование) И НЕ Отказ Тогда
				ДвижениеЗаказ = Движения.ЗаказыКлиентов.Добавить();
				ДвижениеЗаказ.ВидДвижения  = ВидДвиженияНакопления.Расход;
				ДвижениеЗаказ.Период       = Дата;
				ДвижениеЗаказ.Клиент       = Контрагент;
				ДвижениеЗаказ.ЗаказКлиента = ДокументОснование;
				ДвижениеЗаказ.Сумма        = ВыборкаНоменклатура.СуммаВДокументе;
			КонецЕсли;
			
			КоличествоОбщееНоменклатуры   = ВыборкаНоменклатура.КоличествоВДокументе;
			СуммаПродажиОбщееНоменклатуры = ВыборкаНоменклатура.СуммаВДокументе;
			
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ДвижениеПродаж = Движения.Продажи.Добавить();
			ДвижениеПродаж.Период       = Дата;
			ДвижениеПродаж.Номенклатура = ВыборкаНоменклатура.Номенклатура;
			ДвижениеПродаж.Контрагент   = Контрагент;
			ДвижениеПродаж.Сотрудник    = Сотрудник;
			ДвижениеПродаж.Количество   = КоличествоОбщееНоменклатуры;
			ДвижениеПродаж.Сумма        = СуммаПродажиОбщееНоменклатуры;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		ДвижениеВыручка = Движения.Хозрасчетный.Добавить();
		ДвижениеВыручка.СчетДт     = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
		ДвижениеВыручка.СчетКт     = ПланыСчетов.Хозрасчетный.Продажи;
		ДвижениеВыручка.Период     = Дата;
		ДвижениеВыручка.Сумма      = СуммаДокумента;
		ДвижениеВыручка.Содержание = "Отражена выручка от реализации товаров и услуг";
		
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеВыручка.СчетДт, 
		ДвижениеВыручка.СубконтоДт, Контрагент);
	КонецЕсли;   
	
КонецПроцедуры

Процедура ПроверитьДубликатРеализации(Основание)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументОснование", Основание);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Реализация.Ссылка КАК Ссылка,
		|	Реализация.Номер КАК Номер,
		|	Реализация.Дата КАК Дата
		|ИЗ
		|	Документ.Реализация КАК Реализация
		|ГДЕ
		|	Реализация.ДокументОснование = &ДокументОснование
		|	И НЕ Реализация.ПометкаУдаления";
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ТекстИсключения = СтрШаблон("По этой предварительной записи уже создана Реализация № %1 от %2 г.!", 
			Выборка.Номер, Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"));
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
	КонецПроцедуры