Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    Движения.Начисления.Записывать      = Истина;
    Движения.УчетЗатрат.Записывать      = Истина;
    Движения.Хозрасчетный.Записывать    = Истина;
    
    Для Каждого СтрНачисление Из Начисления Цикл
        Движение = Движения.Начисления.Добавить();
        Движение.Сторно               = Ложь;
        Движение.ВидРасчета           = СтрНачисление.ВидРасчета;
        Движение.ПериодДействияНачало = СтрНачисление.ДатаНачала;
        Движение.ПериодДействияКонец  = СтрНачисление.ДатаОкончания;
        Движение.ПериодРегистрации    = ПериодНачисления;
        Движение.БазовыйПериодНачало  = СтрНачисление.ДатаНачала;
        Движение.БазовыйПериодКонец   = СтрНачисление.ДатаОкончания;
        Движение.Сотрудник            = СтрНачисление.Сотрудник;
        Движение.ПоказательРасчета    = СтрНачисление.ПоказательРасчета;
        Движение.График               = СтрНачисление.ГрафикРаботы;
    КонецЦикла;
    
    Движения.Начисления.Записать();
    Движения.Начисления.РассчитатьСуммуНачисления();
    
    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Регистратор", Ссылка);
    Запрос.Текст =
    "ВЫБРАТЬ
    |	Начисления.Сотрудник КАК Сотрудник,
    |	Начисления.ВидРасчета.СтатьяЗатрат КАК СтатьяЗатрат,
    |	Начисления.Сумма КАК Сумма
    |ИЗ
    |	РегистрРасчета.Начисления КАК Начисления
    |ГДЕ
    |	Начисления.Регистратор = &Регистратор
    |ИТОГИ
    |	СУММА(Сумма)
    |ПО
    |	СтатьяЗатрат";
    
    ВыборкаСтатьи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    Пока ВыборкаСтатьи.Следующий() Цикл
        
        ДвЗатраты = Движения.УчетЗатрат.Добавить();
        ДвЗатраты.Период       = Дата;
        ДвЗатраты.СтатьяЗатрат = ВыборкаСтатьи.СтатьяЗатрат;
        ДвЗатраты.Сумма        = ВыборкаСтатьи.Сумма;
        
        ВыборкаДетально = ВыборкаСтатьи.Выбрать();
        Пока ВыборкаДетально.Следующий() Цикл
            ДвБУ = Движения.Хозрасчетный.Добавить();
            ДвБУ.Период     = Дата;
            ДвБУ.СчетДт     = ПланыСчетов.Хозрасчетный.РасходыНаПродажу;
            ДвБУ.СчетКт     = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
            ДвБУ.Сумма      = ВыборкаДетально.Сумма;
            ДвБУ.Содержание = "Отражено начисление заработной платы сотрудникам";
            
            БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвБУ.СчетДт, ДвБУ.СубконтоДт, ВыборкаДетально.СтатьяЗатрат);
            БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвБУ.СчетКт, ДвБУ.СубконтоКт, ВыборкаДетально.Сотрудник);
        КонецЦикла;
        
    КонецЦикла;
    
КонецПроцедуры