Процедура ПолучитьПодтверждениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Наименование = "Получить согласие клиента " + СокрЛП(Клиент.Наименование) + " на регистрацию";
		ФормируемаяЗадача.Предмет = Клиент;
		ФормируемаяЗадача.РольИсполнителя = Справочники.РолиИсполнителей.Администратор;
		ФормируемаяЗадача.ОписаниеЗадачи = "Требуется завершить регистрацию клиента. Необходимо созвониться с клиентом "
		+ СокрЛП(Клиент.Наименование) + " по телефону " + СокрЛП(Клиент.КонтактныйТелефон)
		+ " и получить согласие на регистрацию, а так же дозаполнить карточку клиента - ФИО, Дату рождения, сведение о питомцах и другие данные, которые клиент согласится предоставить";
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьПодтверждениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	РегистрацияПодтверждена = Задача.ПолученоСогласие;
КонецПроцедуры

Процедура КлиентПодтвердилРегистрациюПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = РегистрацияПодтверждена;
	
	Если Результат Тогда
		КлиентОбъект = Клиент.ПолучитьОбъект();
		Если КлиентОбъект <> Неопределено Тогда
			КлиентОбъект.Зарегистрирован = Истина;
			КлиентОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПометкаНаУдалениеОбработка(ТочкаМаршрутаБизнесПроцесса, Отказ) 
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		КлиентОбъект = Клиент.ПолучитьОбъект();
		Если КлиентОбъект <> Неопределено Тогда
			Если НЕ КлиентОбъект.ПометкаУдаления Тогда
				КлиентОбъект.УстановитьПометкуУдаления(Истина);
				КлиентОбъект.Записать();
			КонецЕсли;
			Сообщить(СтрШаблон("Клиент ""%1"" отказался от завершения регистрации и автоматически помечен на удаление.", Клиент));
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры
