&НаСервере
Процедура ЗаполнитьДанныеНаСервере() 
	
	ЗаполнитьЧисловыеПоказатели();
	ЗаполнитьГистограммы();
	ЗаполнитьКруговыеДиаграммы();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодОбработки = НачалоМесяца(ТекущаяДата());
	МесяцСтрокой = Формат(ПериодОбработки, "ДФ='ММММ гггг'");
	ЗаполнитьДанныеНаСервере();  
	ЗагрузитьКурсыВалютНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	Подсказка = "Введите период получения данных";
	ЧастьДаты = ЧастиДаты.Дата;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаПериода", ЭтотОбъект); 
	ПоказатьВводДаты(Оповещение, ПериодОбработки, Подсказка, ЧастьДаты);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПериода(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ПериодОбработки = НачалоМесяца(Результат); 
		МесяцСтрокой = Формат(ПериодОбработки, "ДФ='ММММ гггг'"); 
	КонецЕсли;
	
	ЗаполнитьДанныеНаСервере();     
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЧисловыеПоказатели()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки); 
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки));
	
	Запрос.Текст= 
	"ВЫБРАТЬ
	|    ПродажиОбороты.Регистратор КАК Регистратор,
	|    ПродажиОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|    РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    СУММА(ВТ_Продажи.СуммаОборот) КАК СуммаОборот
	|ИЗ
	|    ВТ_Продажи КАК ВТ_Продажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    СУММА(ВТ_Продажи.СуммаОборот) КАК СуммаОборот,
	|    КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Продажи.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ВТ_КоличествоРегистраторов
	|ИЗ
	|    ВТ_Продажи КАК ВТ_Продажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    ВЫБОР
	|        КОГДА ВТ_КоличествоРегистраторов.Регистратор = 0
	|            ТОГДА 0
	|        ИНАЧЕ ВЫРАЗИТЬ(ВТ_КоличествоРегистраторов.СуммаОборот / ВТ_КоличествоРегистраторов.Регистратор КАК ЧИСЛО(10, 2))
	|    КОНЕЦ КАК СреднийЧек
	|ИЗ
	|    ВТ_КоличествоРегистраторов КАК ВТ_КоличествоРегистраторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    ЗаказыКлиентов.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ЗаписиКлиентов
	|ИЗ
	|    РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
	|ГДЕ
	|    ЗаказыКлиентов.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|    И ЗаказыКлиентов.Регистратор ССЫЛКА Документ.ЗаписьКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗаписиКлиентов.Регистратор) КАК КоличествоЗаписейКлиентов
	|ИЗ
	|    ВТ_ЗаписиКлиентов КАК ВТ_ЗаписиКлиентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗаписиКлиентов.Регистратор) КАК Завершенных
	|ИЗ
	|    ВТ_ЗаписиКлиентов КАК ВТ_ЗаписиКлиентов
	|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|        ПО ВТ_ЗаписиКлиентов.Регистратор = РеализацияТоваровИУслуг.Основание
	|ГДЕ
	|    РеализацияТоваровИУслуг.Проведен";
	
	ВсегоЗаписей = 0; 
	
	РезультатПакет = Запрос.ВыполнитьПакет(); 
	
	ВыборкаПродажи = РезультатПакет.Получить(1).Выбрать(); 
	Если ВыборкаПродажи.Следующий() Тогда
		ВыручкаЧисло = ВыборкаПродажи.СуммаОборот;
	КонецЕсли;
	
	ВыборкаСреднийЧек = РезультатПакет.Получить(3).Выбрать();
	Если ВыборкаСреднийЧек.Следующий() Тогда
		СреднийЧек = ВыборкаСреднийЧек.СреднийЧек;
	КонецЕсли;
	
	ВыборкаЗаписиКлиентов = РезультатПакет.Получить(5).Выбрать();
	Если ВыборкаЗаписиКлиентов.Следующий() Тогда
		ВсегоЗаписей = ВыборкаЗаписиКлиентов.КоличествоЗаписейКлиентов;
	КонецЕсли;
	
	ВыборкаЗаписиКлиентовЗавершенные = РезультатПакет.Получить(6).Выбрать();
	Если ВыборкаЗаписиКлиентовЗавершенные.Следующий() Тогда
		Завершенных = ВыборкаЗаписиКлиентовЗавершенные.Завершенных;
		
		Если ВсегоЗаписей > 0 Тогда
			ПроцентЗавершенных = ОКР((100 * Завершенных / ВсегоЗаписей), 2);
			ЗавершенныхПроцентСтрока = СтрШаблон("Это %1 процентов от всех записей", ПроцентЗавершенных);
		Иначе
			ЗавершенныхПроцентСтрока = "В этом периоде нет записей клиентов!";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГистограммы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    НачалоПериода(Продажи.Период, ДЕНЬ) КАК Период,
	|    Продажи.СуммаОборот КАК СуммаОборот
	|ИЗ
	|    РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Продажи
	|
	|УПОРЯДОЧИТЬ ПО
	|    Период
	|ИТОГИ
	|    СУММА(СуммаОборот)
	|ПО
	|    Период ПЕРИОДАМИ(ДЕНЬ, &ДатаНачала, &ДатаОкончания)";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки));
	
	ДиаграммаВыручка.Обновление = Ложь; 
	ДиаграммаВыручка.Очистить();
	
	Серия = ДиаграммаВыручка.Серии.Добавить("Оборот"); 
	Серия.Цвет = WebЦвета.ЛососьСветлый;
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "Все"); 
	Пока Выборка.Следующий() Цикл
		Точка = ДиаграммаВыручка.Точки.Добавить(Выборка.Период); 
		Точка.Текст = Формат(Выборка.Период, "ДФ=dd.MM.yy"); 
		Точка.Расшифровка = Выборка.Период;
		Подсказка = "Выручка " + Выборка.СуммаОборот + " на " + Формат(Выборка.Период, "ДФ=dd.MM.yyyy");
		ДиаграммаВыручка.УстановитьЗначение(Точка, Серия, Выборка.СуммаОборот, Точка.Расшифровка, Подсказка);
	КонецЦикла;
	
	ДиаграммаВыручка.Обновление = Истина;  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКруговыеДиаграммы() 
	
	ЗаполнитьДиаграммуПоИсточникамИнформации();
	ЗаполнитьДиаграммуПоСотрудникам();
	ЗаполнитьДиаграммуПоУслугам();  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуПоИсточникамИнформации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    ЕСТЬNULL(Продажи.Клиент.ИсточникПолученияИнформации.Представление, ""Не указан"") КАК ИсточникИнформации,
	|    КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Продажи.Регистратор) КАК Количество
	|ИЗ
	|    РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Продажи
	|ГДЕ
	|    Продажи.СуммаОборот <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|    ЕСТЬNULL(Продажи.Клиент.ИсточникПолученияИнформации.Представление, ""Не указан"")";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки));
	
	ДиаграммаПоИсточникамИнформации.Обновление = Ложь;
	ДиаграммаПоИсточникамИнформации.Очистить();
	
	Точка = ДиаграммаПоИсточникамИнформации.Точки.Добавить("Количество");
	Точка.Текст = "Количество";
	Точка.ПриоритетЦвета = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Серия = ДиаграммаПоИсточникамИнформации.Серии.Добавить(Выборка.ИсточникИнформации);
		ДиаграммаПоИсточникамИнформации.УстановитьЗначение(Точка, Серия, Выборка.Количество, Строка(Выборка.Количество));
	КонецЦикла;
	
	ДиаграммаПоИсточникамИнформации.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуПоСотрудникам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    СУММА(Продажи.СуммаОборот) КАК Сумма,
	|    Продажи.Сотрудник.Представление КАК Сотрудник
	|ИЗ
	|    РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Продажи
	|ГДЕ
	|    Продажи.СуммаОборот <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|    Продажи.Сотрудник.Представление";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки));
	
	ДиаграммаПоСотрудникам.Обновление = Ложь;
	ДиаграммаПоСотрудникам.Очистить();
	
	Точка = ДиаграммаПоСотрудникам.Точки.Добавить("Сумма");
	Точка.Текст = "Сумма";
	Точка.ПриоритетЦвета = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Серия = ДиаграммаПоСотрудникам.Серии.Добавить(Выборка.Сотрудник);
		ДиаграммаПоСотрудникам.УстановитьЗначение(Точка, Серия, Выборка.Сумма, Строка(Выборка.Сумма));
	КонецЦикла;
	
	ДиаграммаПоСотрудникам.Обновление = Истина; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуПоУслугам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    Продажи.Номенклатура КАК Номенклатура,
	|    СУММА(Продажи.СуммаОборот) КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_КонкретныеУслуги
	|ИЗ
	|    РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК Продажи
	|ГДЕ
	|    Продажи.СуммаОборот <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|    Продажи.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_ВсеПродажи
	|ИЗ
	|    РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК ПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    ВТ_КонкретныеУслуги.Номенклатура КАК Номенклатура,
	|    ВТ_КонкретныеУслуги.СуммаОборот КАК СуммаПродажНоменклатуры,
	|    ВТ_ВсеПродажи.СуммаОборот КАК ОбщаяСуммаПоУслугам
	|ПОМЕСТИТЬ ВТ_Предытог
	|ИЗ
	|    ВТ_КонкретныеУслуги КАК ВТ_КонкретныеУслуги
	|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеПродажи КАК ВТ_ВсеПродажи
	|        ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    ВЫБОР
	|        КОГДА 100 * ВТ_Предытог.СуммаПродажНоменклатуры / ВТ_Предытог.ОбщаяСуммаПоУслугам > 10
	|            ТОГДА ВТ_Предытог.Номенклатура.Представление
	|        ИНАЧЕ ""Прочее""
	|    КОНЕЦ КАК Номенклатура,
	|    СУММА(ВТ_Предытог.СуммаПродажНоменклатуры) КАК Сумма
	|ИЗ
	|    ВТ_Предытог КАК ВТ_Предытог
	|
	|СГРУППИРОВАТЬ ПО
	|    ВЫБОР
	|        КОГДА 100 * ВТ_Предытог.СуммаПродажНоменклатуры / ВТ_Предытог.ОбщаяСуммаПоУслугам > 10
	|            ТОГДА ВТ_Предытог.Номенклатура.Представление
	|        ИНАЧЕ ""Прочее""
	|    КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки));
	
	ДиаграммаПоУслугам.Обновление = Ложь;
	ДиаграммаПоУслугам.Очистить();
	
	Точка = ДиаграммаПоУслугам.Точки.Добавить("Сумма");
	Точка.Текст = "Сумма";
	Точка.ПриоритетЦвета = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Серия = ДиаграммаПоУслугам.Серии.Добавить(Выборка.Номенклатура);
		ДиаграммаПоУслугам.УстановитьЗначение(Точка, Серия, Выборка.Сумма, Строка(Выборка.Сумма));
	КонецЦикла;
	
	ДиаграммаПоУслугам.Обновление = Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКурсы(Команда)
    ЗагрузитьКурсыВалютНаСервере();
КонецПроцедуры         

&НаСервере
Процедура ПрочитатьИзXMLПоследовательно(СтрокаXML)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	ТекущаяВалюта = Неопределено;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Valute" Тогда
			
			Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
				Если ЧтениеXML.Имя = "ID" Тогда
					Если ЧтениеXML.Значение = "R01235" Тогда
						ТекущаяВалюта = "USD";
					ИначеЕсли ЧтениеXML.Значение = "R01239" Тогда
						ТекущаяВалюта = "EUR";
					ИначеЕсли ЧтениеXML.Значение = "R01335" Тогда 
						ТекущаяВалюта = "KZT";
					Иначе
						ТекущаяВалюта = Неопределено;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; 
			
		КонецЕсли;
		
		Если ТекущаяВалюта <> Неопределено 
			И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента 
			И ЧтениеXML.Имя = "Value" Тогда 
			
			ЧтениеXML.Прочитать();
			
			ЗначениеКурса = Число(СтрЗаменить(ЧтениеXML.Значение, ",", "."));
			
			Если ТекущаяВалюта = "USD" Тогда
				КурсДоллара = ЗначениеКурса;
			ИначеЕсли ТекущаяВалюта = "EUR" Тогда
				КурсЕвро = ЗначениеКурса;
			ИначеЕсли ТекущаяВалюта = "KZT" Тогда
				КурсТенге = ЗначениеКурса;
			КонецЕсли;
			
			ТекущаяВалюта = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыВалютНаСервере()

	ТекущаяДатаЗапроса = ТекущаяДата();

	Сервер       = "www.cbr.ru";
	АдресЗапроса = "/scripts/XML_daily.asp?date_req=" + Формат(ТекущаяДатаЗапроса, "ДФ=dd/MM/yyyy");

	РезультатЗапроса = РаботаСHTTP.ПолучитьДанныеИзСервиса(Сервер, АдресЗапроса);

	Если НЕ РезультатЗапроса.УспешныйЗапрос Тогда
		Сообщить("Ошибка подключения к серверу Центробанка: " + РезультатЗапроса.ТекстОшибки, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

	HTTPОтвет = РезультатЗапроса.HTTPОтвет;
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		Сообщить(СтрШаблон("Центробанк вернул код состояния %1 вместо успешного 200!", HTTPОтвет.КодСостояния), СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

	СтрокаXML = HTTPОтвет.ПолучитьТелоКакСтроку();
	ПрочитатьИзXMLПоследовательно(СтрокаXML);

КонецПроцедуры